Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཉིས་ཡོད་སྐྱེ་བའི་དབང་པོ་ཡབ། །གྲགས་བྱིན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: This victor will be of kṣatriya family, And his light will extend two leagues. “Ruler of Humans will be his father, and Fame Gift will be this victor’s mother.

source: སྲས་པོ་སྐྱེ་ལྡན་འོད་འཕྲོ་རིམ་གྲོ་པ། །
en: Endowed with Birth will be his son and Radiant his attendant.

source: སྒྲ་གཅན་གཟི་བརྗིད་ཅན་ནི་མཁས་པ་སྟེ། །
en: Possessor of Rāhu’s Splendor will be the scholar

source: འཇིགས་པ་མེད་པར་རྒོལ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Fearless Attack the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །ཐ་སྤངས་དུག་རྩ་བཅད་པར་མཚུངས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be thirty-six consecutive congregations, Each of them gathering nine hundred twenty million Who have relinquished anger and, as it were, cut through the poisonous roots.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་ལྔ་ཁྲི་ཡིན། །
en: The lifespan of humans will be fifty thousand years,

source: ཤིན་ཏུ་དུལ་བའི་ཡིད་ལྡན་དམ་ཆོས་དག །ལོ་གྲངས་སུམ་ཁྲི་སུམ་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of this teacher of thoroughly trained mind Will remain for thirty-three thousand years.

source: སངས་རྒྱས་པད་མའི་འོད་ཟེར་སྐྱེ་བའི་ཡུལ། །མེ་ཏོག་དག་གིས་རྣམ་པར་བརྒྱན་ཞེས་བྱ། །
en: “The buddha Padmaraśmi Will be born in a place called Adorned with Flowers.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་པད་མ་བཟང་པོ་ཡབ། །དགའ་བ་སྦྱངས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend three leagues. “Excellent Lotus will be his father, and Pure Joy will be this victor’s mother.

source: སྲས་པོ་པད་མ་ཡིད་འཐད་རིམ་གྲོ་པ། །
en: Lotus will be his son and Reasoning Mind his attendant.

source: མེ་ཏོག་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Flower Joy will be the scholar

source: ཡེ་ཤེས་མེ་ཏོག་ལེགས་རྒྱས་རྫུ་འཕྲུལ་ཅན། །
en: And Blooming Flower of Wisdom the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཞི་སྟེ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་དབང་པོ་ཚང་བའི་བསམ་གཏན་པ། །ཐེར་འབུམ་ཕྲག་ནི་དྲུག་དྲུག་འབྱུང་བར་འགྱུར། །
en: “There will be four consecutive congregations, Each of them gathering six billion Worthy meditators possessing complete faculties.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་བདུན་ཡིན། །
en: The lifespan of humans will be seventeen thousand years,

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བཅུ་དྲུག་པ་ལ་མུ་ཏིག་སྤྲས། །
en: The single relic of this victor will reside In a pearl-studded stūpa, sixteen leagues large.

source: རྣམ་པར་འདྲེན་པ་བརྟུལ་ཞུགས་བཟང་པོ་ཡི། །སྐྱེ་ཡུལ་ཡེ་ཤེས་རྣམ་པར་ངེས་ཞེས་བྱ། །
en: “The guide Suvrata Will be born in a place called Certain Wisdom.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་རྣམ་དག་ཡིན། །ཐོས་པའི་འོད་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །མཛེས་ལྡན་ཤིན་ཏུ་མཛེས་པ་རིམ་གྲོ་པ། །
en: The family of this victor will be brahmin, And his light will extend nine leagues. “Purity will be his father, and Light of Learning will be this victor’s mother. Possessor of Beauty will be his son and Tremendous Beauty his attendant.

source: ཐོགས་པ་མེད་པར་སྟོན་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Unimpeded Teacher the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་སྟེ་ཀུན་ལ་ཡང་། །པད་མཚུངས་སྲིད་པ་ཀུན་ལས་རྣམ་གྲོལ་བ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: “There will be nine consecutive congregations, Each of them gathering nine hundred ninety million Lotus-like beings who are free from all of existence.

source: མྱ་ངན་འདས་པར་ཕྱིན་པའི་དམ་ཆོས་དག །
en: “And the sacred Dharma of the one who attained nirvāṇa

source: ལོ་གྲངས་བརྒྱད་ཁྲི་དགུ་སྟོང་བར་དུ་གནས། །
en: Will remain for eighty-nine thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་བརྒྱད་ཅུ་འབྱུང་། །
en: The relics of this victor will be abundant, And there will appear eight hundred billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་སྒྲོན་མའི་རྒྱལ་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ལྷ་ཡི་འོད་ཅེས་བྱ། །
en: “The thus-gone one Pradīparāja Will be born in a place called Divine Light.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་ལེགས་སྐྱེས་ཡིན། །མེ་ཏོག་ཅན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend three leagues. “Excellent Birth will be his father, and Endowed with Flowers will be this victor’s mother.

source: སྲས་པོ་སྐར་མ་སྐར་བཟངས་རིམ་གྲོ་པ། །
en: Star will be his son and Auspicious Star his attendant.

source: སྣང་བའི་རྒྱ་མཚོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Ocean of Light will be the scholar

source: གཡོ་བ་མེད་པར་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Immutable Abiding the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་དྲུག་ཀུན་ལ་ཡང་། །ང་མེད་ཉོན་མོངས་མེད་པའི་དགྲ་བཅོམ་པ། །བྱེ་བ་སྟོང་ཕྲག་བཅུ་གསུམ་བཅུ་གསུམ་ཡོད། །
en: “There will be sixteen consecutive congregations, Each of them gathering one hundred thirty billion Selfless worthy ones free from defilements.

source: འགོག་པར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of the one gone to cessation Will remain for eighty thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་གསུམ་པ་གཅིག །གསེར་གྱི་དྲ་བ་དག་གིས་ཁེབས་པར་བྱས། །
en: There will be a single stūpa of this victor, Three leagues large and decorated with nets of gold.

source: དེ་བཞིན་གཤེགས་པ་གློག་གི་ཏོག་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་རྟག་ཏུ་མཐོང་ཞེས་བྱ། །
en: “The thus-gone Vidyutketu Will be born in a place called Constant Sight.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་སྨན་པ་བཟང་པོ་ཡབ། །གློག་མཆོད་མ་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཐུབ་མེད་ཤིན་ཏུ་རྣམ་དུལ་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Excellent Doctor will be his father, and Lightning Worship will be this victor’s mother. Indomitable will be his son and Thoroughly Trained his attendant.

source: རིན་ཆེན་འཆང་བ་བློ་གྲོས་ཅན་ཡིན་ཏེ
en: Jewel Holder will be the one of intelligence

source: མཐའ་ཡས་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Light the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་བརྒྱད་དེ། །ཀུན་ལའང་ཞི་བ་མྱ་ངན་འདས་གནས་པ། །དགྲ་བཅོམ་མཆོད་པར་འོས་པ་ཤ་སྟག་གོ། །
en: “There will be sixty-eight consecutive congregations Consisting exclusively of worthy recipients of worship Who abide in nirvāṇa.

source: མི་ཚེ་ལོ་གྲངས་བདུན་ཁྲི་བདུན་སྟོང་ཡིན། །
en: The lifespan of humans will be seventy-seven thousand years,

source: མི་ཡི་ཕུལ་དུ་བྱུང་བའི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་སུམ་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma will remain in the realm of humans For twenty-three thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་གཅིག་པ་རྒྱལ་མཚན་དག་གིས་བརྒྱན། །
en: There will be a single relic of this victor, And the stūpa will be one league large and decorated with banners.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་རྒྱལ་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བཟང་ལ་དགའ་ཞེས་བྱ། །
en: “The thus-gone Raśmirāja Will be born in a place called Delighting in Excellence.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བྱེ་བ་གཉིས་ཡོད་འོད་ཟེར་བཟང་པོ་ཡབ། །ཡོན་ཏན་འོད་ཟེར་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །འོད་ཟེར་བྱིན་ཡིན་ལྷ་ལེགས་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, And his light will extend twenty million leagues. “Excellent Radiance will be his father, and Luminous Qualities will be this victor’s mother. Radiance Gift will be his son and Divine Excellence his attendant.

source: སྣང་བའི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Illuminating Light will be the scholar

source: སྒྲོན་མ་མཐའ་ཡས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Lamp the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །རྡུལ་སྦྱངས་པ་ཡི་དགྲ་བཅོམ་ཚོགས་པ་དག །ཐེར་འབུམ་ཕྲག་ནི་བརྒྱད་ཅུ་བརྒྱད་ཅུ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering eighty billion Worthy ones who have purified materiality.

source: མི་ཚེ་ལོ་གྲངས་ས་ཡ་ཕྲག་བརྒྱད་ཡིན། །
en: The lifespan of humans will be eight million years,

source: སྟོན་པ་མྱ་ངན་འདས་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has attained nirvāṇa His sacred Dharma will remain for seventy-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །སྟོང་གསུམ་མཆོད་རྟེན་བཟང་པོ་དག་གིས་གང་། །
en: The relics of this victor will be abundant, And the trichiliocosm will be filled with fine stūpas.

source: དེ་བཞིན་གཤེགས་པ་སྐར་མཁན་སྐྱེ་བ་ཡི། །ཡུལ་ནི་གསེར་གྱི་གཟི་བརྗིད་ལྡན་ཞེས་བྱ། །
en: “The thus-gone Jyotiṣka Will be born in a place called Golden Splendor.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱད་ཁྲི་ཡབ་ནི་ངོ་ཚ་ཤེས། །ཡོན་ཏན་དགའ་བ་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཡོན་ཏན་ཅན་ཡིན་ལེགས་སྦས་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend eighty thousand leagues. “Conscientious will be his father, and Joyous Qualities will be this victor’s mother. Endowed with Qualities will be his son and Well Concealed his attendant.

source: དབང་པོ་སྦས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Concealed Faculties will be the scholar

source: འཇིགས་མེད་བསམ་གཏན་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Fearless Meditator the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་སྟེ་ཀུན་ལ་ཡང་། །ཐམས་ཅད་འཇིགས་མེད་ཡེ་ཤེས་སྟོབས་ལྡན་པ། །བྱེ་བ་ཕྲག་ནི་སྟོང་ཕྲག་བཅུ་བཅུ་ཡོད། །
en: “There will be ten consecutive congregations, Each of them gathering one hundred billion Who are all endowed with fearless wisdom.

source: འཇིག་རྟེན་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་ཆིག་ཁྲི་ཆིག་སྟོང་བར་དུ་གནས། །
en: “And for the benefit of the world the sacred Dharma Will remain for eleven thousand years.

source: མཆོད་རྟེན་དཔག་ཚད་དྲུག་པ་གསེར་གདུགས་ཅན། །མུ་ཏིག་བཻ་དཱུརྱ་ཡི་དྲ་བས་རྒྱས། །
en: The six-league-tall stūpa will be adorned with parasols And draped with nets of pearl and beryl.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་པ་རྫོགས་ལྡན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་བློ་གྲོས་གྲགས་ཞེས་བྱ། །
en: “The thus-gone Saṃpannakīrti Will be born in a place called Famed Intelligence.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་གཉིས་ཡོད་ཡབ་ནི་ཤིན་ཏུ་གྲགས། །སྲིད་པར་གྲགས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend thirty-two thousand leagues. “Extremely Famed will be his father, and Famed in Existence will be this victor’s mother.

source: སྲས་པོ་མཆོད་ལྡན་ལེགས་མཆོད་རིམ་གྲོ་པ། །
en: Endowed with Worship will be his son and Excellent Worship his attendant.

source: གྲགས་པའི་འབྱུང་གནས་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Source of Fame will be the scholar

source: གྲགས་པ་རྣམ་པར་ངེས་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Famed Certainty the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །ཉོན་མོངས་ཟད་པ་ཡང་སྲིད་མེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་བཞི་བཞི་ཡོད། །
en: “There will be thirty consecutive congregations, Each of them gathering nine hundred forty million Who have brought defilements to exhaustion and are beyond rebirth.

source: མི་ཚེ་ལོ་གྲངས་སུམ་ཁྲི་སུམ་སྟོང་ཡིན། །
en: The lifespan of humans will be thirty-three thousand years,

source: ཟད་མཐར་ཕྱིན་པ་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has accomplished exhaustion His sacred Dharma will remain for seventy-two thousand years.

source: སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་བྱེ་བ་སྟོང་། །གསེར་དང་ནོར་བུའི་ཆུན་པོ་དག་གིས་སྤྲས། །
en: His relics will be abundant, and there will be ten billion stūpas Adorned with gold and jewels.

source: དེ་བཞིན་གཤེགས་པ་པད་མའི་སྙིང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་གསེར་གྱི་སྙིང་པོ་ཡིན། །
en: “The thus-gone Padmagarbha Will be born in a place called Gold Essence.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ལྔ་བཅུ་རྩ་བཞི་ལེགས་པའི་སྙིང་པོ་ཡབ། །བཻ་དཱུརྱ་ཡི་སྙིང་པོ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend fifty-four leagues. “Essence of Goodness will be his father, and Beryl Essence will be this victor’s mother.

source: སྲས་པོ་གསེར་འོད་སེང་གེ་རིམ་གྲོ་པ། །
en: Golden Light will be his son and Lion his attendant.

source: རིན་ཆེན་ལྗོན་པ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Jewel Tree will be the scholar

source: རིན་ཆེན་བློ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Jewel Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་བརྒྱད་ཀུན་ལའང་། །ཐམས་ཅད་ང་མེད་ཉོན་མོངས་ཟད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: “There will be twenty-eight consecutive congregations, Each of them gathering nine hundred ninety million Selfless ones who have brought the defilements to exhaustion.

source: སྲིད་པ་སྤངས་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་བརྒྱད་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has relinquished existence His sacred Dharma will remain for seventy-eight thousand years.

source: འཇིག་རྟེན་མཁྱེན་པའི་མཆོད་རྟེན་དག་གི་གྲངས། །ཐེར་འབུམ་ཕྲག་ནི་བདུན་ཅུ་ཚང་བར་འབྱུང་། །
en: The stūpas of this knower of the world Will number seventy billion.

source: རྐང་གཉིས་མཆོག་མ་དེ་བཞིན་གཤེགས་རྒྱལ་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་ནབས་སོ་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone Puṣya Will be born in a place called Punarvasu.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་ཡབ་ནི་རྒྱུ་སྐར་ཡིན། །རྒྱུ་སྐར་བདག་མོ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Star will be his father, and Star Lady will be this victor’s mother.

source: སྲས་པོ་དགྲ་འདུལ་ཞི་བ་རིམ་གྲོ་པ། །
en: Tamer of Enemies will be his son and Peace his attendant.

source: ཞི་བའི་རྒྱ་མཚོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Ocean of Peace will be the scholar

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །ཐེག་པ་མཆོག་གིས་ཕ་རོལ་ཕྱིན་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་རེ་རེ་ཡོད། །
en: “There will be sixty-six consecutive congregations, Each of them gathering one hundred billion Who have gone beyond by means of the supreme vehicle.

source: མི་ཚེ་ལོ་གྲངས་བརྒྱད་ཁྲི་དགུ་སྟོང་ཡིན། །
en: The lifespan of humans will be eighty-nine thousand years,

source: འགྲོ་ལ་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And for the sake of wandering beings The sacred Dharma will remain for ninety thousand years.

source: དེ་ཡི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བདུན་པ་གསེར་གྱིས་རྣམ་པར་སྤྲས། །
en: There will be a single relic and a single stūpa, Seven leagues large and adorned with gold.

source: བདེ་བར་གཤེགས་པ་སྤྱན་མཛེས་སྐྱེ་བའི་ཡུལ། །ཉམས་དགའ་མིག་ཏུ་སྡུག་པ་ཞེས་ཀྱང་བྱ། །
en: “The well-gone Cārulocana Will be born in a place called Delightful and Beautiful to See.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་མིག་བཟངས་ཡིན། །མིག་སྡུག་ཅེས་ནི་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend ten leagues. “Excellent Eye will be his father, and Lovely Eye will be this victor’s mother.

source: སྲས་པོ་དགའ་བྱེད་མིག་ལེགས་རིམ་གྲོ་པ། །
en: Instiller of Joy will be his son and Fine Eye his attendant.

source: བློ་གནས་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Abiding Mind will be the scholar

source: སྨད་པ་མེད་པའི་ལུས་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Flawless Body the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་སྟེ་ཀུན་ལ་ཡང་། །རི་ལྟར་གཡོ་བ་མེད་པར་མཚུངས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be ten consecutive congregations, Each of them gathering three hundred twenty million Who are immovable, like mountains.

source: རྒྱལ་བ་འགོག་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་གི་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this victor has reached cessation His sacred Dharma will remain for a thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་ཐམས་ཅད་བྱེ་བ་སྟོང་དུ་ཚང་། །
en: The relics of this victor will be abundant, And there will be ten billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་རྙོག་པ་མེད་པའི་དོན། །སྐྱེ་བའི་ཡུལ་ནི་ནོར་གྱིས་བརྒྱན་ཞེས་བྱ། །
en: “The thus-gone Anāvilārtha Will be born in a place called Adorned with Jewels.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གསུམ་ཡོད་ཡབ་ནི་གཟུགས་བཟང་ཡིན། །སེམས་མཚུངས་མ་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཁ་ལོ་སྒྱུར་བ་སྣང་ལྡན་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, And his light will extend twenty-three leagues. “Excellent Form will be his father, and Equal Mind will be this victor’s mother. Leader will be his son and Endowed with Light his attendant.

source: འགྲོ་བའི་དབང་ཕྱུག་ཅེས་བྱ་མཁས་པ་སྟེ། །
en: Master of Wandering Beings will be the scholar

source: དད་པར་བྱེད་པའི་བློ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Mind Instilling Faith the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །སྲེད་མེད་མ་རིག་པ་དང་བྲལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་ལྔ་ལྔ་ཡོད། །
en: “There will be thirty-six consecutive congregations, Each of them gathering three hundred fifty million Who are free from craving and ignorance.

source: འཇིག་རྟེན་མཁྱེན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སུམ་ཁྲི་ལྔ་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of this knower of the world Will remain for thirty-five thousand years.

source: མཆོད་རྟེན་བཟང་པོ་དགུ་ཁྲི་ཉིས་སྟོང་སྟེ། །རྒྱལ་མཚན་དམ་པ་དག་གིས་རྒྱས་པར་འགྱུར། །
en: There will be ninety-two thousand fine stūpas Studded with fine banners.

source: དེ་བཞིན་གཤེགས་པ་དྲག་ཤུལ་སྡེ་སྐྱེ་བའི། །ཡུལ་ནི་དྲག་ཤུལ་ལྡན་པ་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone Ugrasena Will be born in a place called Fierce.

source: དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ཡུལ་འཁོར་བཟང་། །དམན་པ་མིན་ཞེས་བྱ་བ་རྡུལ་བྲལ་ཡུམ། །
en: And his light will extend one hundred leagues. “Land of Excellence will be his father, and Not Inferior will be this victor’s mother.

source: སྲས་པོ་མཛོད་སྤུ་རྫོགས་ལྡན་རིམ་གྲོ་པ། །
en: Treasury Hair will be his son and Accomplished his attendant.

source: ཡོན་ཏན་རྫོགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Perfect Qualities will be the scholar

source: ཆོས་ལ་རྣམ་པར་ངེས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Dharma Ascertainment the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཏེ་ཀུན་ལ་ཡང་། །ཡིད་བཞིན་གྲུབ་པ་དང་ནི་འདྲ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be seven consecutive congregations, Each of them gathering nine hundred twenty million Who resemble wish-fulfilling jewels.

source: འགོག་པར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་སྟོང་ཚང་བར་གནས་པར་འགྱུར། །
en: “And after this teacher has gone to cessation His sacred Dharma will remain complete for ninety thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་གསུམ་པ་སྟེ། །མེ་ཡི་ཕུང་པོ་ལྟ་བུར་འབར་ཞིང་སྤ། །
en: The stūpa of this victor will be three leagues large And ablaze with fire-like splendor.

source: དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་གཟི་བརྗིད་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་བརྒྱན་ཅེས་བྱ། །
en: “The thus-gone Puṇyatejas Will be born in a place called Merit Ornament.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ཏོག་བཟངས་ཡིན། །ཏོག་གི་བློ་གྲོས་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend nine leagues. “Excellent Crest will be his father, and Intelligence Crest will be this victor’s mother.

source: སྲས་པོ་སྐར་མཁན་ལེགས་སྐྱེས་རིམ་གྲོ་པ། །
en: Astrologer will be his son and Excellent Birth his attendant.

source: མཐུ་རྩལ་བརྒྱ་པ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: One Hundred Strengths will be the scholar

source: ཐེ་ཚོམ་སེལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Doubt Dispeller the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །དགྲ་བཅོམ་འཕགས་པའི་ཆོས་ནི་ཐོབ་པ་པོ། །སྲིད་པའི་ཕ་མཐར་ཕྱིན་པ་ཤ་སྟག་གོ། །
en: “There will be sixty-six consecutive congregations, Consisting exclusively of worthy ones Who have achieved the qualities of noble beings and gone beyond existence.

source: མི་ཚེ་ལོ་གྲངས་ལྔ་ཁྲི་དྲུག་སྟོང་ཡིན། །
en: The lifespan of humans will be fifty-six thousand years,

source: རྡུལ་དང་བྲལ་བའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བྱེ་བའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this immaculate one Will remain for ten million years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་གསུམ་པ་སྟེ། །གསེར་གྱི་རྒྱལ་མཚན་མཆོག་སྟོང་སྙེད་ཀྱིས་བརྒྱན། །
en: The stūpa of this victor will be three leagues large And adorned with thousands of supreme golden banners.

source: བདེ་གཤེགས་མཐུ་རྩལ་ཅན་ནི་སྐྱེ་བའི་ཡུལ། །རྣམ་པར་རྒྱལ་བའི་གཟི་བརྗིད་ཅེས་ཀྱང་བྱ། །
en: “The well-gone Vikrama Will be born in a place called Victorious Splendor.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཡོད་ཡབ་ནི་ཤིན་ཏུ་མཛེས། །འགྲོས་མཛེས་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend six leagues. “Tremendous Beauty will be his father, and Beautiful Mode will be this victor’s mother.

source: སྲས་པོ་འགྲོས་ལྡན་ལྷ་ལེགས་རིམ་གྲོ་པ། །
en: Endowed with the Mode will be his son and Divine Excellence his attendant.

source: སྤོབས་པ་འཆང་ཞེས་བྱ་བ་བློ་ཅན་ཏེ། །
en: Acumen Holder will be the scholar

source: སྐྱེས་རབས་ཁ་ལོ་སྒྱུར་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Guide of Generations the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་སྟེ་ཀུན་ལ་ཡང་། །ཐམས་ཅད་ཆགས་པ་མེད་པར་གྱུར་པ་པོ། །བྱེ་ཕྲག་བདུན་ཅུ་གཉིས་གཉིས་འདུས་པར་འགྱུར། །
en: “There will be ten consecutive congregations, Each of them gathering seven hundred twenty million Who are all free from attachment.

source: མྱ་ངན་འདས་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་ཉིས་སྟོང་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of the one who attained nirvāṇa Will remain for two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་ལྔ་པ་གསེར་ལས་བྱས་པ་ཡིན། །
en: There will be a single relic, and the stūpa of this victor Will be five leagues large and made of gold.

source: མགོན་པོ་ཐོགས་མེད་བློ་ནི་སྐྱེ་བའི་ཡུལ། །འཇིག་རྟེན་དག་གིས་འདུལ་བར་དཀའ་ཞེས་བྱ། །
en: “The protector Asaṅgamati Will be born in a place called Hard to Subdue by the World.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་གདུལ་དཀའ་ཡིན། །མཆོད་རྟེན་གྲགས་པ་རྒྱལ་ཡུམ་མཆོད་སྦྱིན་བྱིན། །སྲས་ཡིན་མཆོད་སྦྱིན་བཟང་པོ་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, And his light will extend twenty-two leagues. “Hard to Tame will be his father, and Famed Stūpa will be this victor’s mother. Sacrifice Gift will be his son and Excellent Sacrifice his attendant.

source: གླེང་བ་པོ་ལ་དགའ་བ་མཁས་པ་སྟེ། །
en: Fondness for Questioners will be the scholar

source: མཆོག་གི་རྒྱལ་པོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme King the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གཅིག་ཀུན་ལ་ཡང་། །རི་ལྟར་མི་སྒུལ་ལུས་ནི་སྦྱངས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eleven consecutive congregations, Each of them gathering seven hundred twenty million Who have purified their bodies and are immovable like mountains.

source: མི་ཡི་སློབ་དཔོན་རྒྱལ་བའི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་སྟོང་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this teacher of humanity Will remain for nine thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །རིན་ཆེན་འབུམ་ཕྲག་སྙེད་ནི་འབར་བར་འགྱུར། །
en: The relics of this victor will be abundant And ablaze with the light of hundreds of thousands of jewels.

source: དེ་བཞིན་གཤེགས་པ་སྒྲ་གཅན་ལྷ་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཆུ་ལྷས་མཆོད་ཅེས་བྱ། །
en: “The thus-gone Rāhudeva Will be born in a place called Worshiped by the Water God.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་རྩ་གཉིས་ཡབ་ནི་ལྷ་བཟང་ཡིན། །ལྷ་མ་ཡིན་གྱི་བདག་མོ་རྒྱལ་ཡུམ་སྲས། །རིན་ཆེན་རིན་ཆེན་བཟང་པོ་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend ninety-two leagues. “Divine Excellence will be his father, and Ruler of Demigods will be this victor’s mother. Jewel will be his son and Excellent Jewel his attendant.

source: དགའ་བས་མཆོད་ཅེས་བྱ་བ་བློ་ཅན་ཏེ། །
en: Joyous Worship will be the scholar

source: རྣལ་འབྱོར་ངག་ལ་དད་བྱེད་རྫུ་འཕྲུལ་ཅན། །
en: And Instiller of Faith in the Spiritual Training of Speech the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དྲི་གསུམ་དྲི་མ་གཅོད་པར་བྱེད་པ་པོ། །ཐེར་འབུམ་ཕྲག་ནི་དྲུག་དྲུག་འདུས་པར་འགྱུར། །
en: “There will be eighty consecutive congregations, Each of them gathering six billion Who have dispelled the three stains.

source: ཡོན་ཏན་མཆོག་ཏུ་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of this attainer of supreme qualities Will remain for seventy-four thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །བཅུ་དྲུག་པ་གཅིག་གསེར་གྱིས་སྤྲ་བར་བྱས། །
en: The single stūpa with the relics of this victor Will be sixteen leagues large and decorated with gold.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཕུང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཆོས་ཀྱི་ཕུང་པོ་ཡིན། །
en: “The thus-gone Jñānarāśi Will be born in a place called Dharma Mountain.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་
en: His family will be brahmin,
